--- Router Programming
Router> enable
Router#

Router# configure terminal
Router(config)#

Router(config)#hostname studentid-R1
studentid-R1(config)#exit

--- Router Port Activation
studentid-R1#configure terminal
studentid-R1(config)#interface g0/0/0
studentid-R1(config-if)#no shutdown

--- Router IP Addressing & Activation
studentid-R1(config)#interface g0/0/0
studentid-R1(config-if)#ip address 192.168.10.1 255.255.255.128
studentid-R1(config-if)#no shutdown
studentid-R1(config-if)#end
studentid-R1#sh ip interface brief

--- Router view Configuration
studentid-R1#show run

--- Router Ping
R1# ping 192.168.10.1

--- Router DHCP Programming
studentid-R1#configure terminal
studentid-R1(config)#ip dhcp pool mypool
studentid-R1(dhcp-config)#network 192.168.10.0 255.255.255.128
studentid-R1(dhcp-config)#default-router 192.168.10.1
studentid-R1(dhcp-config)#dns-server 11.1.1.10

--- Router Subinterfaces
studentid-R1#configure terminal
studentid-R1(config)#interface g0/0/1.10
studentid-R1(config-subif)#encapsulation dot1q 10
studentid-R1(config-subif)#ip address 192.168.10.60 255.255.255.192
studentid-R1(config-subif)#exit
studentid-R1(config)#interface g0/0/1.20
studentid-R1(config-subif)#encapsulation dot1q 20
studentid-R1(config-subif)#ip address 192.168.10.129 255.255.255.192
studentid-R1(config-subif)#exit
studentid-R1(config-subif)#end
studentid-R1#

--- Router Password Protect VTY (Virtual Teletype)
studentid-R1(config)#username student password class
studentid-R1(config)#line vty 0 15
studentid-R1(config-line)#transport input all
studentid-R1(config-line)#login local

--- Router Password Protect Auxiliary
studentid-R1(config)#line aux 0
studentid-R1(config-line)#password cisco

--- Router Password Enable
studentid-R1(config)#enable password ecpi
studentid-R1(config)#enable secret cisco
studentid-R1(config)#service password-encryption

--- Router Password Protect Console
studentid-R1(config)#line console 0
studentid-R1(config-line)#password cisco
studentid-R1(config-line)#login

--- Router RIPv2
studentid-R1(config)#router rip
studentid-R1(config-router)#version 2
studentid-R1(config-router)#network 192.168.10.0
studentid-R1(config-router)#network 11.0.0.0
studentid-R1(config)#no ip route 0.0.0.0. 0.0.0.0. 11.0.0.1

--- Router OSPF
studentid-R1(config)#router ospf 1
studentid-R1(config-router)#network 192.168.10.0 0.0.0.255 area 2
studentid-R1(config-router)#network 11.0.0.0 0.0.0.255 area 0

--- Router Save Configuration
studentid-R1#copy running-config startup-config
